app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(sort_column + " " + sort_direction)
---
SELECT "movies".* FROM "movies" WHERE "rating"."R" = '1' ORDER BY title ASC, title