app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."PG-13" = '1' ORDER BY title
---
  def index
    redirect = false

    @rating_names = Movie.get_ratings.keys

    session[:ratings] ||= Movie.get_ratings
    session[:sort] ||= sort_column

    # Make array of ratings to be filtered by
    @ratings_filter = params[:commit] ? params[:ratings].keys : session[:ratings]


    if params[:commit]
      session[:ratings] = params[:ratings]
      redirect = true
    end

    if params[:sort]
      session[:sort] = params[:sort]
      #redirect = true
    end

    if redirect
      redirect_to movies_path :sort=>session[:sort], :ratings=>session[:ratings]
    end

    @movies = Movie.find(:all, :order=>sort_column, :conditions => {:rating => session[:ratings].keys})